[
  {
    "id": 1,
    "pergunta": "Ao utilizar ferramentas de IA, como o ChatGPT, para mapear processos organizacionais, qual é a principal responsabilidade do usuário?",
    "alternativas": [
      "Deixar que a IA defina os dados e os processos sem intervenção",
      "Pedir que a IA substitua totalmente o conhecimento prático da empresa",
      "Garantir que a IA compreenda sozinha o contexto organizacional",
      "Evitar o fornecimento de informações contextuais para simplificar o uso",
      "Validar e ajustar as informações geradas conforme a realidade da empresa"
    ],
    "correta": "Validar e ajustar as informações geradas conforme a realidade da empresa"
  },
  {
    "id": 2,
    "pergunta": "Por que o uso de informações contextuais e detalhadas é fundamental ao empregar IA para mapeamento de processos?",
    "alternativas": [
      "Para que a IA se torne independente e dispense validação",
      "Porque isso garante maior precisão e relevância dos resultados obtidos",
      "Para que os processos fiquem iguais em qualquer organização",
      "Para reduzir a participação humana na análise crítica",
      "Porque a IA compreende automaticamente qualquer ambiente de negócio"
    ],
    "correta": "Porque isso garante maior precisão e relevância dos resultados obtidos"
  },
  {
    "id": 3,
    "pergunta": "Segundo Anderson Guedes, qual prática pode auxiliar na coleta de informações específicas e na documentação de processos de forma eficiente?",
    "alternativas": [
      "Utilizar apenas documentos oficiais e ignorar e-mails ou anotações",
      "Solicitar à IA respostas genéricas sem dados adicionais",
      "Evitar discussões sobre dificuldades e riscos nos processos",
      "Confiar unicamente nos comandos curtos fornecidos à IA",
      "Transcrever automaticamente reuniões com ferramentas digitais"
    ],
    "correta": "Transcrever automaticamente reuniões com ferramentas digitais"
  },
  {
    "id": 4,
    "pergunta": "De acordo com o vídeo, qual é a principal vantagem de usar IA no mapeamento de processos em comparação com métodos tradicionais?",
    "alternativas": [
      "Facilitar a coleta, organização e clareza dos documentos produzidos",
      "Eliminar totalmente a necessidade de conhecimento do gestor",
      "Substituir reuniões presenciais por relatórios automáticos",
      "Evitar a participação de diferentes envolvidos no processo",
      "Garantir que não seja necessário revisar as informações geradas"
    ],
    "correta": "Facilitar a coleta, organização e clareza dos documentos produzidos"
  },
  {
    "id": 5,
    "pergunta": "Sobre a disjunção inclusiva, assinale a alternativa correta. Em qual caso p OU q é falsa?",
    "alternativas": [
      "Nunca é falsa, pois é uma tautologia.",
      "Quando p é falsa e q é verdadeira.",
      "Quando p é verdadeira e q é falsa.",
      "Somente quando p e q são ambas falsas.",
      "Quando exatamente uma das proposições é verdadeira."
    ],
    "correta": "Somente quando p e q são ambas falsas."
  },
  {
    "id": 6,
    "pergunta": "Sobre o condicional, assinale a equivalência lógica verdadeira. A proposição 'se p então q' é logicamente equivalente a qual expressão formada por NÃO e OU?",
    "alternativas": [
      "p E NÃO q.",
      "NÃO p E q.",
      "NÃO p OU q.",
      "NÃO (p OU q).",
      "p OU q."
    ],
    "correta": "NÃO p OU q."
  },
  {
    "id": 7,
    "pergunta": "Classifique a fórmula p OU NÃO p na lógica proposicional clássica.",
    "alternativas": [
      "Contingência, pois pode ser verdadeira ou falsa dependendo de p.",
      "Equivalente a p E NÃO p, logo sempre falsa.",
      "Contradição, pois é falsa para qualquer valor de p.",
      "Não é uma proposição, pois envolve negação.",
      "Tautologia, pois é verdadeira para qualquer valor de p."
    ],
    "correta": "Tautologia, pois é verdadeira para qualquer valor de p."
  },
  {
    "id": 8,
    "pergunta": "Considere p = Verdadeiro, q = Falso e r = Verdadeiro. Avalie a expressão (p E q) OU NÃO r. Indique o valor lógico correto do todo.",
    "alternativas": [
      "Verdadeiro.",
      "Sem valor de verdade por envolver disjunção com uma conjunção.",
      "Falso.",
      "Indeterminado.",
      "Não é uma fórmula bem formada."
    ],
    "correta": "Falso."
  },
  {
    "id": 9,
    "pergunta": "Ao utilizar sistemas de numeração, qual alternativa descreve corretamente o papel da base em um sistema de numeração?",
    "alternativas": [
      "A base corresponde à quantidade de símbolos utilizados no sistema e define como os valores são representados.",
      "A base indica o número máximo que pode ser representado em um sistema de numeração.",
      "A base limita o sistema numérico apenas a números naturais, sem representar valores negativos.",
      "A base é determinada pela posição relativa do algarismo em um número.",
      "A base é apenas um identificador simbólico, sem relação com a quantidade de dígitos disponíveis."
    ],
    "correta": "A base corresponde à quantidade de símbolos utilizados no sistema e define como os valores são representados."
  },
  {
    "id": 10,
    "pergunta": "Qual é a justificativa correta para o uso do sistema hexadecimal em áreas como endereçamento de memória e protocolos de internet?",
    "alternativas": [
      "Porque o sistema hexadecimal dispensa a necessidade de conversões entre bases numéricas.",
      "Porque o sistema hexadecimal permite cálculos matemáticos mais rápidos que o sistema binário.",
      "Porque o sistema hexadecimal utiliza menos dígitos para representar grandes valores, facilitando a leitura e escrita.",
      "Porque o sistema hexadecimal substitui totalmente o uso do binário em operações computacionais.",
      "Porque o sistema hexadecimal é o único sistema capaz de representar endereços de forma precisa."
    ],
    "correta": "Porque o sistema hexadecimal utiliza menos dígitos para representar grandes valores, facilitando a leitura e escrita."
  },
  {
    "id": 11,
    "pergunta": "Assinale a alternativa que apresenta corretamente a diferença entre sistemas posicionais e não posicionais.",
    "alternativas": [
      "Sistemas posicionais atribuem valor fixo aos símbolos, enquanto sistemas não posicionais variam o valor conforme a posição.",
      "Nos sistemas posicionais não existe representação para o número zero, enquanto nos não posicionais o zero é um elemento obrigatório.",
      "Sistemas posicionais utilizam a posição do algarismo para determinar seu valor, enquanto nos sistemas não posicionais o valor é sempre fixo.",
      "Sistemas não posicionais atribuem valores distintos aos símbolos dependendo de sua posição, enquanto os sistemas posicionais possuem símbolos fixos.",
      "Ambos os sistemas funcionam da mesma forma, diferenciando-se apenas na quantidade de símbolos disponíveis."
    ],
    "correta": "Sistemas posicionais utilizam a posição do algarismo para determinar seu valor, enquanto nos sistemas não posicionais o valor é sempre fixo."
  },
  {
    "id": 12,
    "pergunta": "Qual das alternativas apresenta corretamente uma aplicação prática do sistema hexadecimal?",
    "alternativas": [
      "Determinar a quantidade de núcleos de um processador.",
      "Representar instruções executadas pela CPU no ciclo de instrução.",
      "Representar valores RGB em cores digitais, utilizando pares de dígitos hexadecimais para cada componente.",
      "Definir algoritmos de ordenação em linguagens de programação.",
      "Realizar operações aritméticas básicas em sistemas operacionais."
    ],
    "correta": "Representar valores RGB em cores digitais, utilizando pares de dígitos hexadecimais para cada componente."
  },
  {
    "id": 13,
    "pergunta": "Qual é o papel principal da engenharia de dados em relação à inteligência artificial (IA) e Machine Learning (ML)?",
    "alternativas": [
      "Projetar a interface do usuário para aplicações de IA, garantindo uma boa experiência para o cliente.",
      "Desenvolver novos algoritmos de Machine Learning para detecção de anomalias em dados.",
      "Garantir a coleta, processamento, estruturação e disponibilização de dados de alta qualidade para o treinamento, validação e operação de modelos de IA e Machine Learning.",
      "Otimizar o hardware e a infraestrutura de rede para o treinamento de modelos de IA em grande escala.",
      "Analisar os resultados dos modelos de IA e apresentar relatórios gerenciais para a tomada de decisões de negócios."
    ],
    "correta": "Garantir a coleta, processamento, estruturação e disponibilização de dados de alta qualidade para o treinamento, validação e operação de modelos de IA e Machine Learning."
  },
  {
    "id": 14,
    "pergunta": "Qual das seguintes alternativas descreve corretamente as características dos dados estruturados, semiestruturados e não estruturados?",
    "alternativas": [
      "A principal distinção é que dados estruturados são sempre armazenados em bancos de dados NoSQL, semiestruturados em data lakes, e não estruturados em data warehouses.",
      "Dados não estruturados são caracterizados por esquemas flexíveis e adaptáveis, como documentos XML, enquanto dados semiestruturados e estruturados sempre seguem um formato tabular rígido.",
      "Dados estruturados são organizados em bases com esquema claro (ex: tabelas SQL), dados semiestruturados possuem alguma organização sem esquema rígido (ex: JSON), e dados não estruturados não têm formato predefinido (ex: imagens e vídeos).",
      "Dados estruturados são os mais difíceis de classificar por exigirem pré-processamento complexo para remover anomalias e duplicatas antes de qualquer análise.",
      "Dados semiestruturados não possuem qualquer formato ou organização interna, como imagens e vídeos, tornando-os os mais complexos para a engenharia de dados processar e analisar."
    ],
    "correta": "Dados estruturados são organizados em bases com esquema claro (ex: tabelas SQL), dados semiestruturados possuem alguma organização sem esquema rígido (ex: JSON), e dados não estruturados não têm formato predefinido (ex: imagens e vídeos)."
  },
  {
    "id": 15,
    "pergunta": "Qual das seguintes afirmações melhor define o conceito de Engenharia de Dados?",
    "alternativas": [
      "A Engenharia de Dados foca exclusivamente na otimização de consultas em bancos de dados relacionais para garantir o acesso rápido a informações, sem envolver a coleta ou transformação de dados não estruturados.",
      "Engenharia de Dados é a gestão e o arquivamento de dados históricos em Data Warehouses, com o objetivo principal de garantir a conformidade regulatória e a segurança, sem foco em análises preditivas ou operacionais.",
      "A Engenharia de Dados se refere principalmente à criação de relatórios e dashboards em tempo real para tomada de decisões, utilizando apenas dados brutos diretamente das fontes, sem a necessidade de um processamento ou estruturação prévia complexa.",
      "A Engenharia de Dados é, essencialmente, a prática de desenvolver algoritmos e modelos de Machine Learning e Inteligência Artificial para extrair insights, sendo a preparação de dados uma tarefa secundária e delegada a outras equipes.",
      "A Engenharia de Dados é a disciplina que se dedica a projetar, construir e manter sistemas e processos para coletar, processar e estruturar dados brutos de diversas fontes (estruturadas, semiestruturadas e não estruturadas), transformando-os em informações de alta qualidade, consistentes e acionáveis para uso em análises, Machine Learning e Inteligência Artificial."
    ],
    "correta": "A Engenharia de Dados é a disciplina que se dedica a projetar, construir e manter sistemas e processos para coletar, processar e estruturar dados brutos de diversas fontes (estruturadas, semiestruturadas e não estruturadas), transformando-os em informações de alta qualidade, consistentes e acionáveis para uso em análises, Machine Learning e Inteligência Artificial."
  },
  {
    "id": 16,
    "pergunta": "Considerando o cenário atual da Engenharia de Dados em empresas, na internet e em dados gerados por modelos, qual afirmação melhor descreve a prevalência e os desafios relacionados aos tipos de dados?",
    "alternativas": [
      "A distinção entre dados estruturados, semiestruturados e não estruturados está se tornando obsoleta, pois as ferramentas modernas de engenharia de dados conseguem processar todos eles com a mesma facilidade e sem grandes diferenças nos desafios.",
      "Os dados semiestruturados, como JSON e XML, são predominantes na integração de sistemas via APIs, mas sua complexidade é menor do que a dos dados não estruturados, sendo mais fácil adaptá-los a esquemas.",
      "Dados estruturados continuam sendo o tipo mais comum e de mais fácil manejo, visto que a maioria dos sistemas de registro ainda se baseia em esquemas rígidos e bem definidos.",
      "Os ecossistemas de big data contemporâneos são caracterizados por formatos de dados heterogêneos e dinâmicos, com uma notável mudança e proliferação de dados semiestruturados e não estruturados, que, juntamente com os estruturados, exigem novas abordagens e tornam a gestão da qualidade mais complexa.",
      "Embora os dados estruturados sejam importantes, os dados não estruturados são os mais volumosos e representam o maior desafio, especialmente aqueles gerados por sensores IoT e mídias sociais, devido à sua completa falta de organização."
    ],
    "correta": "Os ecossistemas de big data contemporâneos são caracterizados por formatos de dados heterogêneos e dinâmicos, com uma notável mudança e proliferação de dados semiestruturados e não estruturados, que, juntamente com os estruturados, exigem novas abordagens e tornam a gestão da qualidade mais complexa."
  }
,
  {
    "id": 17,
    "pergunta": "Como a natureza iterativa do Design Thinking se relaciona com o Mapa de Empatia?",
    "alternativas": [
      "Substitui a prototipagem pelo uso exclusivo do Mapa de Empatia.",
      "Elimina a necessidade de revisar hipóteses ao longo do processo.",
      "Permite atualizar continuamente o Mapa de Empatia conforme novos insights surgem.",
      "Impede que as soluções sejam adaptadas após os testes.",
      "Transforma o processo em linear e sem retornos a etapas anteriores."
    ],
    "correta": "Permite atualizar continuamente o Mapa de Empatia conforme novos insights surgem."
  },
  {
    "id": 18,
    "pergunta": "Como a etapa de empatia e o uso do Mapa de Empatia diferenciam o Design Thinking de abordagens lineares e tecnicistas?",
    "alternativas": [
      "Porque tornam desnecessária a etapa de testes, já que tudo é resolvido na empatia.",
      "Porque substituem a prototipagem pela coleta de percepções subjetivas.",
      "Porque permitem compreender profundamente o usuário e adaptar as soluções às suas necessidades.",
      "Porque eliminam a necessidade de coletar dados, focando apenas na intuição da equipe.",
      "Porque transformam o processo em uma sequência rígida de etapas sem revisões."
    ],
    "correta": "Porque permitem compreender profundamente o usuário e adaptar as soluções às suas necessidades."
  },
  {
    "id": 19,
    "pergunta": "Por que é importante considerar aspectos objetivos e subjetivos no Mapa de Empatia dentro do Design Thinking?",
    "alternativas": [
      "Porque substitui a etapa de testes, eliminando retrabalhos.",
      "Porque amplia a compreensão do usuário, revelando necessidades ocultas.",
      "Porque garante que apenas dados financeiros sejam avaliados.",
      "Porque torna a ideação mais rápida sem necessidade de pesquisa.",
      "Porque limita a análise apenas ao que o usuário diz em entrevistas."
    ],
    "correta": "Porque amplia a compreensão do usuário, revelando necessidades ocultas."
  },
  {
    "id": 20,
    "pergunta": "Qual é a principal contribuição do Mapa de Empatia para o alinhamento das equipes durante a etapa de empatia no Design Thinking?",
    "alternativas": [
      "Definir métricas financeiras para o projeto.",
      "Garantir que o processo ocorra de forma linear e sem revisões.",
      "Criar um protótipo inicial antes da coleta de dados.",
      "Organizar percepções dos usuários e alinhar entendimentos entre a equipe.",
      "Estabelecer o cronograma de execução da solução."
    ],
    "correta": "Organizar percepções dos usuários e alinhar entendimentos entre a equipe."
  },
  {
    "id": 21,
    "pergunta": "Qual das proposições abaixo é uma tautologia, isto é, é sempre verdadeira independentemente dos valores de verdade de p e q?",
    "alternativas": [
      "p ↔ q",
      "p ∨ ¬p",
      "p ∨ q",
      "p → q",
      "p ∧ ¬p"
    ],
    "correta": "p ∨ ¬p"
  },
  {
    "id": 22,
    "pergunta": "Qual expressão é logicamente equivalente a p → q (implicação material)?",
    "alternativas": [
      "p ∧ q",
      "p ∨ ¬q",
      "¬p ∨ q",
      "¬p ∧ q",
      "¬(p ∧ q)"
    ],
    "correta": "¬p ∨ q"
  },
  {
    "id": 23,
    "pergunta": "Dadas as premissas: 1) p → q 2) p. Qual é a conclusão logicamente válida?",
    "alternativas": [
      "q",
      "¬p",
      "p ↔ q",
      "¬q",
      "p ∧ q"
    ],
    "correta": "q"
  },
  {
    "id": 24,
    "pergunta": "Em qual caso a proposição condicional p → q é falsa?",
    "alternativas": [
      "p é falsa e q é verdadeira",
      "Nenhuma das opções: p → q é sempre verdadeira",
      "p é verdadeira e q é verdadeira",
      "p é falsa e q é falsa",
      "p é verdadeira e q é falsa"
    ],
    "correta": "p é verdadeira e q é falsa"
  },
  {
    "id": 25,
    "pergunta": "Considerando os fundamentos de tipos de dados, entrada e saída em Python, qual alternativa descreve corretamente o comportamento esperado de input() e print()?",
    "alternativas": [
      "É obrigatório declarar tipos antes do uso das variáveis para que print() funcione corretamente.",
      "Valores digitados como True/False são automaticamente interpretados como booleanos por input().",
      "input() retorna valores no tipo mais provável; portanto, int() e float() só são necessários em casos raros.",
      "print() exige que todo valor seja convertido manualmente para str, mesmo quando passado como argumento separado por vírgula.",
      "input() retorna sempre str; para tratar números é preciso converter explicitamente (ex.: int('20'), float('1.75')). Já print() aceita múltiplos argumentos e dispensa conversão manual quando separados por vírgulas."
    ],
    "correta": "input() retorna sempre str; para tratar números é preciso converter explicitamente (ex.: int('20'), float('1.75')). Já print() aceita múltiplos argumentos e dispensa conversão manual quando separados por vírgulas."
  },
  {
    "id": 26,
    "pergunta": "Sobre concatenação, join(), f-strings e múltiplos argumentos em print(), assinale a alternativa correta.",
    "alternativas": [
      "A expressão 'Idade: ' + idade funciona porque Python converte automaticamente qualquer número para str ao usar +.",
      "print('A idade é', idade) evita conversão manual e insere um espaço entre os argumentos, sendo uma forma idiomática de misturar texto e números.",
      "f-strings só funcionam com valores str; números precisam ser convertidos com str() previamente.",
      "Para unir palavras de uma lista em uma frase, concatenar com + em laço é sempre superior a ' '.join(lista).",
      "join() aceita listas com números e converte cada item implicitamente para texto."
    ],
    "correta": "print('A idade é', idade) evita conversão manual e insere um espaço entre os argumentos, sendo uma forma idiomática de misturar texto e números."
  },
  {
    "id": 27,
    "pergunta": "Dadas as entradas '  joão da silva  ', '19', 'anápolis', qual será a saída correta do programa que usa title() no nome e upper() na cidade?",
    "alternativas": [
      "João Da Silva tem 19 anos e mora em ANÁPOLIS.",
      "joão da silva tem 19 anos e mora em anápolis.",
      "João da Silva tem 19 anos e mora em Anápolis.",
      "O programa gera TypeError ao concatenar str com int.",
      "João Da Silva tem 19 anos e mora em Anápolis."
    ],
    "correta": "João Da Silva tem 19 anos e mora em ANÁPOLIS."
  },
  {
    "id": 28,
    "pergunta": "Sobre imutabilidade de strings, indexação e fatiamento em Python, assinale a alternativa correta.",
    "alternativas": [
      "Strings são mutáveis; métodos como upper() alteram o objeto original.",
      "No fatiamento s[início:fim], o índice fim é incluído no resultado.",
      "A indexação negativa (s[-1]) acessa o último caractere; fatiar com s[0:3] retorna os três primeiros caracteres; e métodos como upper()/title() retornam novas strings sem modificar a original.",
      "replace('a','o') substitui apenas a primeira ocorrência por padrão.",
      "strip() remove todos os espaços em branco, inclusive os internos entre palavras."
    ],
    "correta": "A indexação negativa (s[-1]) acessa o último caractere; fatiar com s[0:3] retorna os três primeiros caracteres; e métodos como upper()/title() retornam novas strings sem modificar a original."
  },
  {
    "id": 29,
    "pergunta": "Qual função do Pandas é a mais adequada para importar dados de um arquivo Excel (.xlsx ou .xls) para um DataFrame?",
    "alternativas": [
      "pd.get_spreadsheet()",
      "pd.read_csv()",
      "pd.read_excel()",
      "pd.load_excel()",
      "pd.import_sheet()"
    ],
    "correta": "pd.read_excel()"
  },
  {
    "id": 30,
    "pergunta": "Qual das alternativas apresenta corretamente uma vantagem e uma limitação associadas ao uso de dados em planilhas (como arquivos CSV/Excel) no contexto da Engenharia de Dados?",
    "alternativas": [
      "Vantagem: Possuem mecanismos de segurança e versionamento robustos por padrão. Limitação: Seu uso é restrito a equipes muito grandes e com alta experiência em engenharia de software.",
      "Vantagem: São o formato mais eficiente para armazenar grandes volumes de dados não estruturados. Limitação: Não permitem a aplicação de qualquer tipo de transformação ou manipulação de dados.",
      "Vantagem: Oferecem garantia intrínseca de alta qualidade e consistência dos dados. Limitação: Exigem sempre a utilização de ferramentas proprietárias caras para sua manipulação.",
      "Vantagem: Sua simplicidade e ampla disponibilidade facilitam a coleta e o acesso inicial aos dados. Limitação: Frequentemente apresentam desafios de qualidade, como a presença de tipos de dados misturados e inconsistências, exigindo limpeza e preparação.",
      "Vantagem: São a única forma de dados que pode ser lida e explorada com a biblioteca Pandas. Limitação: Não podem ser compartilhadas em ambientes de colaboração como o Google Colab."
    ],
    "correta": "Vantagem: Sua simplicidade e ampla disponibilidade facilitam a coleta e o acesso inicial aos dados. Limitação: Frequentemente apresentam desafios de qualidade, como a presença de tipos de dados misturados e inconsistências, exigindo limpeza e preparação."
  },
  {
    "id": 31,
    "pergunta": "Após importar um conjunto de dados de um arquivo CSV ou Excel para um DataFrame do Pandas em Python, qual é o primeiro passo essencial para iniciar a exploração e obter uma visão geral da estrutura e das primeiras linhas dos dados?",
    "alternativas": [
      "Aplicar imediatamente técnicas avançadas de tratamento de outliers e inconsistências.",
      "Criar um novo repositório no GitHub para versionar o código e a documentação.",
      "Utilizar as funções df.head() e df.shape para visualizar as primeiras linhas e as dimensões do DataFrame.",
      "Desenvolver um painel interativo no Power BI ou Data Studio para apresentar os resultados.",
      "Executar um algoritmo de Machine Learning para identificar padrões ocultos."
    ],
    "correta": "Utilizar as funções df.head() e df.shape para visualizar as primeiras linhas e as dimensões do DataFrame."
  },
  {
    "id": 32,
    "pergunta": "Qual das seguintes opções melhor descreve o papel fundamental da Engenharia de Dados para a implantação bem-sucedida de sistemas baseados em Inteligência Artificial (IA)?",
    "alternativas": [
      "A Engenharia de Dados atua primariamente na criação de interfaces de usuário avançadas para os sistemas de IA, sem envolver a gestão dos dados subjacentes.",
      "A Engenharia de Dados é responsável por desenvolver diretamente os algoritmos de Machine Learning (ML) e os modelos preditivos que serão utilizados pelos sistemas de IA.",
      "O papel principal da Engenharia de Dados é garantir a qualidade e a estrutura dos dados, projetando, construindo e mantendo a infraestrutura robusta e escalável necessária para o desenvolvimento, implantação e manutenção de componentes de ML e IA.",
      "O objetivo da Engenharia de Dados é substituir completamente a necessidade de engenheiros de software no ciclo de vida de desenvolvimento de aplicações com IA.",
      "A Engenharia de Dados foca exclusivamente na coleta inicial de dados brutos, sem se preocupar com etapas posteriores de processamento ou preparação para a IA."
    ],
    "correta": "O papel principal da Engenharia de Dados é garantir a qualidade e a estrutura dos dados, projetando, construindo e mantendo a infraestrutura robusta e escalável necessária para o desenvolvimento, implantação e manutenção de componentes de ML e IA."
  }
]
